<a href="https://colab.research.google.com/github/amandazevedo01/MachineLearning_/blob/main/Introducao_a_ciencia_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

## Lendo Banco de dados

In [ ]:
dados = pd.read_csv('/content/train.csv')

In [ ]:
dados.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Editando Chave e Vari√°vel Resposta

In [ ]:
dados = dados.drop(['Name', 'Ticket', 'Cabin', 'Embarked'], axis = 1)

In [ ]:
dados = dados.set_index(['PassengerId'])

In [ ]:
dados = dados.rename(columns = {'Survived': 'target'}, inplace=False)

In [ ]:
dados['sex_f'] = np.where(dados['Sex'] == 'female', 1, 0)
#onde for femele sera 1, assim ele entende, porq ele n aceita str

Descritiva

In [ ]:
dados.describe()

           target      Pclass         Age  ...       Parch        Fare       sex_f
count  891.000000  891.000000  714.000000  ...  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118  ...    0.381594   32.204208    0.352413
std      0.486592    0.836071   14.526497  ...    0.806057   49.693429    0.477990
min      0.000000    1.000000    0.420000  ...    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000  ...    0.000000    7.910400    0.000000
50%      0.000000    3.000000   28.000000  ...    0.000000   14.454200    0.000000
75%      1.000000    3.000000   38.000000  ...    0.000000   31.000000    1.000000
max      1.000000    3.000000   80.000000  ...    6.000000  512.329200    1.000000

[8 rows x 7 columns]

In [ ]:
dados.describe(include=['O'])

         Sex
count    891
unique     2
top     male
freq     577

Transforma√ß√£o dos dados

In [ ]:
dados['Pclass1'] = np.where(dados['Pclass'] == 1, 1, 0)
dados['Pclass2'] = np.where(dados['Pclass'] == 2, 1, 0)
dados['Pclass3'] = np.where(dados['Pclass'] == 3, 1, 0)

In [ ]:
dados = dados.drop(['Pclass', 'Sex'], axis=1)
#ja usei a pclass em outras variaveis, 1 2 e 3

In [ ]:
dados.head()

             target   Age  SibSp  Parch  ...  sex_f  Pclass1  Pclass2  Pclass3
PassengerId                              ...
1                 0  22.0      1      0  ...      0        0        0        1
2                 1  38.0      1      0  ...      1        1        0        0
3                 1  26.0      0      0  ...      1        0        0        1
4                 1  35.0      1      0  ...      1        1        0        0
5                 0  35.0      0      0  ...      0        0        0        1

[5 rows x 9 columns]

In [ ]:
dados.isnull().sum()

target       0
Age        177
SibSp        0
Parch        0
Fare         0
sex_f        0
Pclass1      0
Pclass2      0
Pclass3      0
dtype: int64

In [ ]:
dados.fillna(0, inplace=True)

In [ ]:
dados.isnull().sum()

target     0
Age        0
SibSp      0
Parch      0
Fare       0
sex_f      0
Pclass1    0
Pclass2    0
Pclass3    0
dtype: int64

In [ ]:
dados.dtypes

target       int64
Age        float64
SibSp        int64
Parch        int64
Fare       float64
sex_f        int64
Pclass1      int64
Pclass2      int64
Pclass3      int64
dtype: object

AMOSTRAGEM

aqui estamos segmentando a base de dados
utilizamos 70% para treinar o modelo e 30% para testar

In [ ]:
x_train, x_test, y_train, y_test = train_test_split(
    dados.drop(['target'], axis=1), dados['target'], test_size = 0.3, random_state = 1224)
[{'treino': x_train.shape},{'teste': x_test.shape}]

[{'treino': (623, 8)}, {'teste': (268, 8)}]

MODELO

In [ ]:
rndforest = RandomForestClassifier(n_estimators=1000,
                                   criterion='gini',
                                   max_depth=5)

In [ ]:
rndforest.fit(x_train, y_train)

# uma amostra com mil arvores, 5 de profundidade com criterio gini

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [ ]:
propabilidade = rndforest.predict_proba(dados.drop('target', axis=1))[:,1]
classificacao = rndforest.predict(dados.drop('target', axis=1))

In [ ]:
dados['propabilidade'] = propabilidade
dados['classificacao'] = classificacao

In [ ]:
print(dados.head())

             target   Age  SibSp  ...  Pclass3  propabilidade  classificacao
PassengerId                       ...
1                 0  22.0      1  ...        1       0.137900              0
2                 1  38.0      1  ...        0       0.944592              1
3                 1  26.0      0  ...        1       0.521424              1
4                 1  35.0      1  ...        0       0.944780              1
5                 0  35.0      0  ...        1       0.124629              0

[5 rows x 11 columns]